Repository: mehdiraized/social-auto-share
Catalog: languages/social-auto-share-*.po
Languages: fa_ir

source: Social Auto Share
fa_ir: اشتراک‌گذاری خودکار

source: Social Share
fa_ir: اشتراک‌گذاری

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Enable this platform
fa_ir: فعال‌سازی این پلتفرم

source: Enable sharing for %s
fa_ir: فعال‌سازی اشتراک‌گذاری برای %s

source: %s Settings
fa_ir: تنظیمات %s

source: Telegram
fa_ir: تلگرام

source: Telegram Settings
fa_ir: تنظیمات تلگرام

source: Bot Token
fa_ir: توکن ربات

source: Enter your Telegram Bot Token
fa_ir: توکن ربات تلگرام خود را وارد کنید

source: Enter your Telegram Bot Token (get it from @BotFather)
fa_ir: توکن ربات تلگرام خود را وارد کنید (از @BotFather دریافت کنید)

source: Channel ID
fa_ir: شناسه کانال

source: Enter your Telegram Channel ID (e.g., @channelname)
fa_ir: شناسه کانال تلگرام خود را وارد کنید (مثال: @channelname)

source: Message Template
fa_ir: قالب پیام

source: Custom message template. Available variables: {title}, {excerpt}, {url}, {author}, {date}
fa_ir: قالب پیام سفارشی. متغیرهای قابل استفاده: {title}, {excerpt}, {url}, {author}, {date}

source: Include Featured Image
fa_ir: شامل تصویر شاخص

source: Send featured image as a separate message
fa_ir: ارسال تصویر شاخص به صورت پیام جداگانه

source: Parse Mode
fa_ir: حالت پارس

source: Markdown
fa_ir: مارک‌داون

source: Choose how to format your messages
fa_ir: نحوه قالب‌بندی پیام‌ها را انتخاب کنید

source: Read More
fa_ir: ادامه مطلب

source: Invalid Telegram Bot Token format
fa_ir: فرمت توکن ربات تلگرام نامعتبر است

source: Invalid Telegram Channel ID format
fa_ir: فرمت شناسه کانال تلگرام نامعتبر است

source: Posts
fa_ir: نوشته‌ها

source: Post Types
fa_ir: انواع نوشته

source: Select which post types to share
fa_ir: انتخاب کنید کدام نوع نوشته‌ها اشتراک‌گذاری شوند

source: Categories
fa_ir: دسته‌ها

source: Select specific categories to share (leave empty for all)
fa_ir: دسته‌های خاص برای اشتراک‌گذاری را انتخاب کنید (برای همه خالی بگذارید)

source: Exclude Categories
fa_ir: دسته‌های مستثنی

source: Select categories to exclude from sharing
fa_ir: دسته‌هایی که نباید اشتراک‌گذاری شوند را انتخاب کنید

source: Share Updates
fa_ir: اشتراک بروزرسانی‌ها

source: Share post updates when post is modified
fa_ir: اشتراک‌گذاری بروزرسانی‌های نوشته هنگام تغییر

source: Minimum Word Count
fa_ir: حداقل تعداد کلمات

source: Minimum number of words required to share (leave empty to disable)
fa_ir: حداقل تعداد کلمات لازم برای اشتراک‌گذاری (برای غیرفعال کردن خالی بگذارید)

source: Excerpt Length
fa_ir: طول خلاصه

source: Number of words in the excerpt (default: 55)
fa_ir: تعداد کلمات در خلاصه متن (پیش‌فرض: 55)

source: Error sending message: %s
fa_ir: خطا در ارسال پیام: %s

source: Error sending photo: %s
fa_ir: خطا در ارسال تصویر: %s

source: Platform not properly configured
fa_ir: پلتفرم به درستی پیکربندی نشده است

source: Failed to send image
fa_ir: خطا در ارسال تصویر

source: Telegram Setup Guide
fa_ir: راهنمای اتصال به تلگرام

source: Step 1: Create Telegram Bot
fa_ir: گام 1: ساخت بات تلگرام

source: Message @BotFather on Telegram
fa_ir: به بات @BotFather در تلگرام پیام بدهید

source: Send the /newbot command
fa_ir: دستور /newbot را ارسال کنید

source: Enter a display name for your bot
fa_ir: نام نمایشی برای بات خود وارد کنید

source: Choose a unique username for your bot (must end in "bot")
fa_ir: یک نام کاربری منحصر به فرد برای بات خود انتخاب کنید (باید به bot ختم شود)

source: BotFather will send you a token - copy it and paste it in the "Bot Token" field
fa_ir: BotFather یک توکن برای شما ارسال می‌کند - آن را کپی کنید و در فیلد "Bot Token" قرار دهید

source: Step 2: Add Bot to Channel
fa_ir: گام 2: افزودن بات به کانال

source: Go to your Telegram channel
fa_ir: به کانال تلگرام خود بروید

source: Click on the channel name to open the menu
fa_ir: روی نام کانال کلیک کنید تا منو باز شود

source: Select "Administrators"
fa_ir: گزینه "Administrators" یا "مدیران" را انتخاب کنید

source: Click "Add Administrator"
fa_ir: روی "Add Admin" یا "افزودن مدیر" کلیک کنید

source: Search for your bot username and select it
fa_ir: نام کاربری بات خود را جستجو کنید و آن را انتخاب نمایید

source: Enable "Post Messages" and "Edit Messages" permissions for the bot
fa_ir: دسترسی‌های "Post Messages" و "Edit Messages" را برای بات فعال کنید

source: Save the changes
fa_ir: تغییرات را ذخیره کنید

source: Step 3: Configure Plugin
fa_ir: گام 3: پیکربندی افزونه

source: Enter your bot token in the "Bot Token" field
fa_ir: توکن بات را در فیلد "Bot Token" وارد کنید

source: Enter your channel ID in the format @channelname in the "Channel ID" field
fa_ir: شناسه کانال خود را با فرمت @channelname در فیلد "Channel ID" وارد کنید

source: Configure your message template (optional)
fa_ir: قالب پیام خود را تنظیم کنید (اختیاری)

source: Save the settings
fa_ir: تنظیمات را ذخیره کنید

source: Important Notes:
fa_ir: نکات مهم:

source: Make sure the bot is added as an administrator to the channel
fa_ir: اطمینان حاصل کنید که بات به عنوان مدیر به کانال اضافه شده است

source: The bot must have posting and editing permissions in the channel
fa_ir: بات باید دسترسی ارسال و ویرایش پیام در کانال را داشته باشد

source: You can publish a test post to verify the setup
fa_ir: برای تست، می‌توانید یک پست آزمایشی منتشر کنید

source: Support Us
fa_ir: حمایت کنید

source: Thank you for using Social Auto Share! This plugin is a labor of love, designed to help you to automatically sharing content to social media platforms. If you find it useful, please consider supporting its development.
fa_ir: از استفاده شما از Social Auto Share متشکریم! این افزونه با عشق طراحی شده است تا به شما کمک کند بتوانید محتوا خود را خودکار در شبکه‌های اجتماعی به اشتراک‌ بگذارید. اگر آن را مفید می‌دانید، لطفاً در توسعه آن حمایت کنید.

source: Your support helps cover the costs of maintaining and improving the plugin, ensuring it remains free and accessible for everyone. Every little bit helps and is greatly appreciated!
fa_ir: حمایت شما به پوشش هزینه‌های نگهداری و بهبود افزونه کمک می‌کند، و اطمینان می‌دهد که برای همه رایگان و قابل دسترس باقی بماند. هر کمکی ارزشمند است و بسیار قدردانی می‌شود!

source: Thank you for your generosity and support!
fa_ir: از سخاوت و حمایت شما متشکریم!
